html/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kanishak | Home</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css" />

</head>
<body>
<div id="content" class="content">
<ul class="sidebar" id="mySideNav">
  <a id="menu" href="javascript:void(0);" class="icon" onclick="myFunction()"><b>MENU</b></a>
  <a id="home" href="/index.html">Home</a>
  <a id="research" href="/research-topics/index.html">Research Topics</a>
  <a id="publications" href="/publications.html">Publications</a>
  <a id="blogs" href="/blogs/index.html">Blogs</a>
  <a id="projects" href="/projects/index.html">Projects</a>
  <a id="bio" href="/bio.html">Bio</a>
</ul>

<script>
function myFunction() {
  var x = document.getElementById("mySideNav");
  if (x.className === "sidebar") {
    x.className += " responsive";
  } else {
    x.className = "sidebar";
  }
}
</script>
<div class="logo">
<a class="logo__link" title="Kanishak Vaidya" rel="home">
<div class="logo__item logo__text">
<div class="logo__title">Kanishak Vaidya</div>
<div class="logo__tagline">Senior Engineer | Qualcomm Bangalore.</div>
</div></a>
<!-- div style="float:right;">
  <div class="toggle-light light" ></div >
</div-->
</div>

<script> document.querySelectorAll("#mySideNav a#home")[0].classList.add("active"); </script>

<div id="outline-container-org9db387f" class="outline-2">
<h2 id="org9db387f">About Me</h2>
<div class="outline-text-2" id="text-org9db387f">
<p>
I am a Senior Engineer at Qualcomm Bangalore, India. As part of Wireless Research and Development (WRD) team, my current area of focus is on cutting edge communication technologies.
Prior to joining Qualcomm, I completed my PhD from the Indian Institute of Science, Bangalore, with a research interest in wireless distributed systems. During my PhD, I have worked on distributed machine learning systems, broadcast networks for information retrieval and delivery, and wireless cache-aided networks, focusing on privacy and security.
</p>

<p>
After acquiring AIR 10 in GATE (EC) 2018, I joined IISc for an M.Tech in signal processing and upgraded to a PhD after one year. I have hands-on experience in image processing and computer vision projects. I also have a strong background in coding and information theory.
</p>
<hr />
</div>
<div id="outline-container-org8b0de0d" class="outline-3">
<h3 id="org8b0de0d">Achievements</h3>
<div class="outline-text-3" id="text-org8b0de0d">
<ul class="org-ul">
<li>Received Prime Minister's Research Fellowship (PMRF) from January 2020 to July 2023</li>
<li>Achieved All India Rank 10 in GATE EC 2018. GATE Score: 1000</li>
<li>Achieved All India Rank 30 in Junior Mathematical Olympiad 2011</li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-orgfa5b291" class="outline-3">
<h3 id="orgfa5b291">Technical Skills</h3>
<div class="outline-text-3" id="text-orgfa5b291">
<ul class="org-ul">
<li><b>PROGRAMMING:</b> Python, Octave/MATLAB, C/C++, Bash scripting</li>
<li><b>SOFTWARE TOOLS:</b> LTspice, LabView, Arduino IDE, SimuLink</li>
<li><b>MISCELLANEOUS:</b> Linux, SSH, git, \(\LaTeX\), HTML/CSS, vim, emacs</li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-orged475b3" class="outline-3">
<h3 id="orged475b3">Relevant Courses</h3>
<div class="outline-text-3" id="text-orged475b3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Matrix Theory</b></td>
<td class="org-left">Random Process</td>
</tr>

<tr>
<td class="org-left">Error Control Coding</td>
<td class="org-left"><b>Digital Communication</b></td>
</tr>

<tr>
<td class="org-left"><b>Machine Learning</b></td>
<td class="org-left">Detection and Estimation</td>
</tr>

<tr>
<td class="org-left">Optimization</td>
<td class="org-left"><b>Space Time Signal Processing</b></td>
</tr>

<tr>
<td class="org-left"><b>Computer Vision</b></td>
<td class="org-left">Digital Image Processing</td>
</tr>

<tr>
<td class="org-left">Time Frequency Analysis</td>
<td class="org-left"><b>Wireless Communication</b></td>
</tr>
</tbody>
</table>
<hr />
</div>
<div id="outline-container-org739a794" class="outline-4">
<h4 id="org739a794">Useful links</h4>
<div class="outline-text-4" id="text-org739a794">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://kanishakvaidya.github.io/resume">Resume</a></td>
<td class="org-left"><a href="https://www.linkedin.com/in/kanishakvaidya/">LinkedIn</a></td>
<td class="org-left"><a href="mailto:kanishakvaidya@gmail.com">Email</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
